---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionTextPosition
source: html/40a7f256-c68a-5f3b-9994-885c619b8e03.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionTextPosition Property

Identifies the text position with respect to dimension line.

## Syntax (C#)
```csharp
public BendingDetailDimensionTextPosition AngularDimensionTextPosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration